Revit 2027 API
RenderDuration Enumeration
 An enumerated type containing possible duration types to do Raytracer render.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RenderDuration
Public Enumeration RenderDuration
public enum class RenderDuration
type RenderDuration
Members
Member name | Value | Description
ByLevel | 0 |  Render by the defined iterations.
ByTime | 1 |  Render by the defined time.
UntilSatisfactory | 2 |  Render until satisfactory.
See Also
Reference
Autodesk.Revit.DB Namespace